/**
 * Created by wangxh on 2017/7/26.
 */

'use strict';

var ast_cmd = {
    ast_0x00000001: '0x00000001',//资产新增
    ast_0x00000002: '0x00000002',//资产修改
    ast_0x00000003: '0x00000003',//资产删除、取消
    ast_0x00000004: '0x00000004',//资产查询

    ast_0x00000005: '0x00000005',//供应商新增
    ast_0x00000006: '0x00000006',//供应商修改
    ast_0x00000007: '0x00000007',//供应商删除
    ast_0x00000008: '0x00000008',//供应商查询

    ast_0x00000009: '0x00000009',//客户新增
    ast_0x0000000A: '0x0000000A',//客户修改
    ast_0x0000000B: '0x0000000B',//客户删除
    ast_0x0000000C: '0x0000000C',//客户查询

    ast_0x0000000D: '0x0000000D',//资产类型修改
    ast_0x0000000E: '0x0000000E',//资产类型获取

    ast_0x0000000F: '0x0000000F',//属性新增
    ast_0x00000010: '0x00000010',//属性修改
    ast_0x00000011: '0x00000011',//属性删除
    ast_0x00000012: '0x00000012',//属性查询

    ast_0x00000013: '0x00000013',//配件新增
    ast_0x00000014: '0x00000014',//配件修改
    ast_0x00000015: '0x00000015',//配件删除、取消
    ast_0x00000016: '0x00000016',//配件查询

    ast_0x00000017: '0x00000017',//资产详情查询
    ast_0x00000018: '0x00000018',//配件详情查询
    ast_0x00000019: '0x00000019',//(预留)

    ast_0x00000020: '0x00000020',//配件类型新增
    ast_0x00000021: '0x00000021',//配件类型修改
    ast_0x00000022: '0x00000022',//配件类型删除
    ast_0x00000023: '0x00000023',//配件类型获取

    ast_0x00010001: '0x00010001',//资产出库、取消
    ast_0x00010002: '0x00010002',//资产启用、停用
    ast_0x00010003: '0x00010003',//资产维修、修复
    ast_0x00010004: '0x00010004',//资产报废、取消
    ast_0x00010005: '0x00010005',//配件出库

    ast_0x00020001: '0x00020001',//资产统计
    ast_0x00020002: '0x00020002',//维护计划列表（当月）
    ast_0x00020003: '0x00020003',//资产更新列表（建议）
    ast_0x00020004: '0x00020004',//维保统计
    ast_0x00020005: '0x00020005',//维修记录(最后50条)

    ast_0x00020010: '0x00020010',//资产统计(分组)
};

module.exports = ast_cmd;