/**
 * Created by wangxh on 2017/7/26.
 */

'use strict';

var egy_cmd = {
    cmd_0x00001001: '0x00001001',//指标(PUE,PLF,CLF,ALF)能耗总览(实时)
    cmd_0x00001002: '0x00001002',//指标(PUE,PLF,CLF,ALF)能耗总览(24小时)
    cmd_0x00001003: '0x00001003',//指标(PUE,PLF,CLF,ALF)能耗总览(当月)
    cmd_0x00001004: '0x00001004',//指标(PUE,PLF,CLF,ALF)能耗总览(当年)
    cmd_0x00001005: '0x00001005',//指标(PUE,PLF,CLF,ALF)曲线(天)
    cmd_0x00001006: '0x00001006',//系统能耗分布(今日)
    cmd_0x00001007: '0x00001007',//系统能耗分布(24小时)
    cmd_0x00001008: '0x00001008',//系统能耗曲线(日)
    cmd_0x00001009: '0x00001009',//机房能耗(今日)
    cmd_0x0000100A: '0x0000100A',//指标(PUE,PLF,CLF,ALF)能耗总览(指定时间段)
    cmd_0x0000100B: '0x0000100B',//能耗分布图(昨天)
    cmd_0x0000100C: '0x0000100C',//能耗分布图(当月)
    cmd_0x0000100D: '0x0000100D',//系统能耗分布(日)
    cmd_0x0000100E: '0x0000100E',//系统能耗分布(月)
    cmd_0x0000100F: '0x0000100F',//机房能耗(当月)
    cmd_0x00001011: '0x00001011',//系统能耗分布曲线(日)
    cmd_0x00001012: '0x00001012',//系统能耗分布曲线(月)
    cmd_0x00001013: '0x00001013',//机房PUE曲线(日)
    cmd_0x00001014: '0x00001014',//机房PUE曲线(月)
    cmd_0x00001015: '0x00001015',//机房能耗曲线(日)
    cmd_0x00001016: '0x00001016',//机房能耗曲线(月)
    cmd_0x00001018: '0x00001018',//机房平均功率(当月)
    cmd_0x00001019: '0x00001019',//机房PUE曲线(日)
    cmd_0x0000101A: '0x0000101A',//机房IT/制冷能耗曲线(日)
    cmd_0x0000101B: '0x0000101B',//机房IT/制冷能耗曲线(月)
    cmd_0x0000101C: '0x0000101C',//机房功率曲线(日)
    cmd_0x00001023: '0x00001023',//列柜能耗曲线(日)
    cmd_0x00001025: '0x00001025',//制冷系统能耗分布曲线(日)
    cmd_0x00001026: '0x00001026',//制冷系统能耗分布曲线(月)
    cmd_0x00001027: '0x00001027',//制冷系统总能耗曲线(日)
    cmd_0x00001028: '0x00001028',//制冷系统设备统计
    cmd_0x00001029: '0x00001029',//制冷系统各组能耗排名前3的设备(日，周，月)
    cmd_0x0000102A: '0x0000102A',//制冷系统组设备能耗分布(日)
    cmd_0x0000102B: '0x0000102B',//制冷系统组设备能耗分布(月)
    cmd_0x00001036: '0x00001036',//辅助系统能耗分布曲线(日)
    cmd_0x00001037: '0x00001037',//辅助系统能耗分布曲线(月)
    cmd_0x00001038: '0x00001038',//辅助系统总能耗曲线(日)
    cmd_0x00001039: '0x00001039',//楼栋能耗(当月)
    cmd_0x0000103A: '0x0000103A',//辅助系统设备统计
    cmd_0x0000103B: '0x0000103B',//电源系统能耗曲线(日)
    cmd_0x0000103C: '0x0000103C',//电源系统组能耗曲线(日)
    cmd_0x0000103D: '0x0000103D',//电源系统设备统计
    cmd_0x0000103E: '0x0000103E',//配电层级功率分布(实时)
    cmd_0x0000103F: '0x0000103F',//UPS输出功率曲线(日)
    cmd_0x00001040: '0x00001040',//UPS效率(实时)
    cmd_0x00001041: '0x00001041',//UPS负载(实时)
    cmd_0x00001042: '0x00001042',//UPS效率曲线(日)
    cmd_0x00001043: '0x00001043',//UPS效率曲线(月)
    cmd_0x00001044: '0x00001044',//HVDC输出功率曲线(日)
    cmd_0x00001045: '0x00001045',//HVDC效率(实时)
    cmd_0x00001046: '0x00001046',//HVDC负载(实时)
    cmd_0x00001047: '0x00001047',//HVDC效率曲线(日)
    cmd_0x00001048: '0x00001048',//HVDC效率曲线(月)
    cmd_0x00001049: '0x00001049',//机房制冷能耗曲线(日)
    cmd_0x0000104A: '0x0000104A',//机房制冷能耗曲线(月)
    cmd_0x0000104B: '0x0000104B',//IT系统能耗曲线(日)
    cmd_0x0000104C: '0x0000104C',//机房能耗曲线(日)
    cmd_0x0000104D: '0x0000104D',//机房能耗曲线(月)
    cmd_0x00001050: '0x00001050',//机房机柜数量统计
    cmd_0x00001051: '0x00001051',//(废弃)
    cmd_0x00001052: '0x00001052',//(废弃)
    cmd_0x00001053: '0x00001053',//(废弃)
    cmd_0x00001054: '0x00001054',//机房PUE曲线(月)
    cmd_0x00001055: '0x00001055',//机房空调、机柜统计
    cmd_0x00001057: '0x00001057',//(废弃)
    cmd_0x00001058: '0x00001058',//机房环境统计(日)
    cmd_0x00001059: '0x00001059',//机房环境统计(月)
    cmd_0x0000105A: '0x0000105A',//UPS能耗曲线(日)
    cmd_0x0000105B: '0x0000105B',//UPS能耗曲线(月)
    cmd_0x0000105C: '0x0000105C',//HVDC能耗曲线(日)
    cmd_0x0000105D: '0x0000105D',//HVDC能耗曲线(月)
    cmd_0x0000105F: '0x0000105F',//机房列表
    cmd_0x00001060: '0x00001060',//机房平均PUE(昨日)
    cmd_0x00001061: '0x00001061',//机房平均PUE(当月)

    cmd_0x0000203A: '0x0000203A',//设备统计(区域)
    cmd_0x0000203E: '0x0000203E',//机房列柜列表
    cmd_0x0000203F: '0x0000203F',//用电排名前15的机柜(昨天)
    cmd_0x00002040: '0x00002040',//用电排名前15的机柜(周)
    cmd_0x00002041: '0x00002041',//用电排名前15的机柜(月)
    cmd_0x00002042: '0x00002042',//机柜、设备能耗曲线(日)
    cmd_0x00002043: '0x00002043',//机柜、设备能耗曲线(月)
    cmd_0x00002044: '0x00002044',//指定列柜机柜能耗(昨日)
    cmd_0x00002045: '0x00002045',//指定列柜机柜能耗(当月)
    cmd_0x00002046: '0x00002046',//空调能耗(昨日)
    cmd_0x00002048: '0x00002048',//空调能耗(当月)
    cmd_0x00002049: '0x00002049',//水泵能耗(昨日)
    cmd_0x0000204A: '0x0000204A',//水泵能耗(当月)
    cmd_0x0000204B: '0x0000204B',//UPS能耗(昨日)
    cmd_0x0000204C: '0x0000204C',//UPS能耗(当月)
    cmd_0x0000204D: '0x0000204D',//HVDC能耗(昨日)
    cmd_0x0000204E: '0x0000204E',//HVDC能耗(当月)

    cmd_0x00003001: '0x00003001',//总能耗环比
    cmd_0x00003002: '0x00003002',//总能耗同比
    cmd_0x00003003: '0x00003003',//系统能耗环比(参数：system: 1,2,3)
    cmd_0x00003004: '0x00003004',//系统能耗同比(参数：system: 1,2,3)
    cmd_0x00003005: '0x00003005',//COP曲线(日)
    cmd_0x00003006: '0x00003006',//冷水机组COP及曲线(日)

    cmd_0x00003011: '0x00003011',//指定对象(同类型)某指标值
    cmd_0x00003012: '0x00003012',//指定对象(同类型)某指标曲线（实时）
    cmd_0x00003013: '0x00003013',//指定对象(同类型)某指标曲线（日）
    cmd_0x00003014: '0x00003014',//指定对象(同类型)某指标曲线（月）
    cmd_0x00003015: '0x00003015',//(废弃)
    cmd_0x00003016: '0x00003016',//(保留)(可用0x00001009)
    cmd_0x00003017: '0x00003017',//能耗环比
    cmd_0x00003018: '0x00003018',//能耗同比
    cmd_0x00003019: '0x00003019',//系统能耗环比
    cmd_0x0000301A: '0x0000301A',//系统能耗同比
    cmd_0x0000301B: '0x0000301B',//系统能耗(日)
    cmd_0x0000301C: '0x0000301C',//机房PUE曲线(日)
    cmd_0x0000301D: '0x0000301D',//用电排名前15的机房能耗(日， 周，月，自定义)
    cmd_0x0000301E: '0x0000301E',//cop实时+曲线(日)
    cmd_0x0000301F: '0x0000301F',//项目用水量排名
    cmd_0x00003020: '0x00003020',//用电排名前15的机柜能耗(日， 周，月，自定义)

    cmd_0x00003030: '0x00003030',//社区用电排名(日， 周，月，自定义)

    cmd_0x00004001: '0x00004001',//能耗统计信息(园区)
    cmd_0x00004002: '0x00004002',//功率历史曲线(园区)
    cmd_0x00004003: '0x00004003',//能耗曲线(园区)(日)
    cmd_0x00004004: '0x00004004',//温度曲线(园区)
    cmd_0x00004005: '0x00004005',//园区COP

    cmd_0x00004011: '0x00004011',//楼栋能耗统计信息
    cmd_0x00004012: '0x00004012',//楼栋功率历史曲线
    cmd_0x00004013: '0x00004013',//楼栋能耗曲线(日)
    cmd_0x00004014: '0x00004014',//楼栋温度曲线
    cmd_0x00004015: '0x00004015',//楼栋COP

    cmd_0x00004020: '0x00004020',//机房统计信息
    cmd_0x00004021: '0x00004021',//机房PUE
    cmd_0x00004022: '0x00004022',//机房温度
    cmd_0x00004023: '0x00004023',//机房能耗（当月）
    cmd_0x00004024: '0x00004024',//机房温度（最近1小时）
};

module.exports = egy_cmd;