/**
 * Created by wangxh on 2017/5/17.
 */

'use strict';

var cetl_cmd = {
    cen_0x00000000: 0x00000000, //转发
    //登陆验证
    cen_0x00000001: 0x00000001, //验证
    cen_0x00000002: 0x00000002, //保活
    cen_0x00000003: 0x00000003, //同步数据
    cen_0x00000004: 0x00000004, //模式切换
    cen_0x00000005: 0x00000005, //获取当前模式
    cen_0x00000006: 0x00000006, //应用模式数据

    cen_0x0000000A: 0x0000000A, //获取服务器信息
    cen_0x0000000B: 0x0000000B, //获取服务器状态
    cen_0x00000010: 0x00000010, //发送通知
    cen_0x00000011: 0x00000011, //邮箱配置
    cen_0x00000012: 0x00000012, //邮箱配置获取
    cen_0x00000013: 0x00000013, //钉钉配置
    cen_0x00000014: 0x00000014, //钉钉配置获取
    cen_0x00000015: 0x00000015, //电话服务配置
    cen_0x00000016: 0x00000016, //电话服务配置获取

    //数据服务接口
    cen_0x00010001: 0x00010001, //查询实时点值(设备)
    cen_0x00010002: 0x00010002, //查询实时点值(设备点)
    cen_0x00010003: 0x00010003, //查询设备状态
    cen_0x00010005: 0x00010005, //查询实时点值(设备点)

    cen_0x00010006: 0x00010006, //查询授权状态
    cen_0x00010007: 0x00010007, //下载授权文件
    cen_0x00010008: 0x00010008, //上传授权文件

    cen_0x00010010: 0x00010010, //点值控制
    cen_0x00010011: 0x00010011, //采集器实时配置
    cen_0x00010012: 0x00010012, //采集器实时配置获取
    cen_0x00010013: 0x00010013, //采集器实时请求

    //告警服务接口
    cen_0x00020002: 0x00020002, //告警手动结束
    cen_0x00020003: 0x00020003, //告警确认
    cen_0x00020004: 0x00020004, //告警挂起
    cen_0x00020005: 0x00020005, //告警强制结束
    cen_0x00020008: 0x00020008, //告警解挂
    cen_0x00020010: 0x00020010, //查询当前告警
    cen_0x00020011: 0x00020011, //告警动作同步(odcc)
    cen_0x00020012: 0x00020012, //离线告警获取(odcc)
    
    //查询服务接口
    cen_0x00030001: 0x00030001, //查询历史点
    cen_0x00030002: 0x00030002, //查询历史点(小时)
    cen_0x00030003: 0x00030003, //查询历史点(天)
    cen_0x00030004: 0x00030004, //查询历史点(指定时间)
    cen_0x00030005: 0x00030005, //查询历史点(指定时间段)

    cen_0x00030010: 0x00030010, //查询双机切换记录
};

module.exports = cetl_cmd;