/**
 * Created by wangxh on 2017/7/26.
 */

'use strict';

var itr_cmd = {
    //基础数据
    itr_0x0000000A: '0x0000000A',//获取服务器信息

    itr_0x00000001: '0x00000001',//树结构(区域,基本)
    itr_0x00000002: '0x00000002',//树结构(设备,基本)
    itr_0x00000003: '0x00000003',//查询子对象信息
    itr_0x00000004: '0x00000004',//查询设备点列表(带告警配置，不用需要配置请使用:0x00000008)
    itr_0x00000005: '0x00000005',//查询点值(设备)
    itr_0x00000006: '0x00000006',//查询点值(设备点)
    itr_0x00000007: '0x00000007',//查询采集设备点列表
    itr_0x00000008: '0x00000008',//设备模板(点表)
    itr_0x00000009: '0x00000009',//获取对象信息(树、采集对象)
    itr_0x00000010: '0x00000010',//获取对象路径
    itr_0x00000011: '0x00000011',//获取对象信息<基本信息>
    itr_0x00000012: '0x00000012',//对象查询

    itr_0x00000020: '0x00000020',//树结构(区域,扩展)
    itr_0x00000021: '0x00000021',//获取对象配置(批量)

    itr_0x00000030: '0x00000030',//园区信息查询
    itr_0x00000031: '0x00000031',//楼栋信息查询
    itr_0x00000032: '0x00000032',//机房(预留)
    itr_0x00000033: '0x00000033',//机柜(预留)
    itr_0x00000034: '0x00000034',//设备

    itr_0x00000040: '0x00000040',//获取采集拓扑结构
    itr_0x00000041: '0x00000041',//获取机房状态
    itr_0x00000042: '0x00000042',//获取逻辑设备状态
    itr_0x00000043: '0x00000043',//获取逻辑设备统计
    itr_0x00000044: '0x00000044',//获取逻辑设备状态
    itr_0x00000045: '0x00000045',//区域逻辑设备类型

    //告警、工单
    itr_0x00010001: '0x00010001',//查询告警（未自动结束）
    itr_0x00010002: '0x00010002',//查询告警（已自动结束）
    itr_0x00010003: '0x00010003',//查询频繁告警（历史）
    itr_0x00010004: '0x00010004',//查询告警操作记录
    itr_0x00010005: '0x00010005',//设备点告警记录
    itr_0x00010006: '0x00010006',//故障工单查询
    itr_0x00010007: '0x00010007',//维护工单查询
    itr_0x00010008: '0x00010008',//演练工单查询
    itr_0x00010009: '0x00010009',//告警查询

    //历史点
    itr_0x00010011: '0x00010011',//监控量历史数据
    itr_0x00010012: '0x00010012',//电池放电曲线

    //容量、资产
    itr_0x00010021: '0x00010021',//机柜开通信息
    itr_0x00010022: '0x00010022',//机柜使用容量
    itr_0x00010023: '0x00010023',//设备使用容量
    itr_0x00010024: '0x00010024',//机房资产统计
    itr_0x00010025: '0x00010025',//资产类型统计

    //运维
    itr_0x00010031: '0x00010031',//机柜信息
    itr_0x00010032: '0x00010032',//设备统计
    itr_0x00010033: '0x00010033',//用户操作记录
    itr_0x00010034: '0x00010034',//系统日志记录
    itr_0x00010035: '0x00010035',//动环设备信息
    itr_0x00010036: '0x00010036',//动环串口信息

    //能耗
    itr_0x00010041: '0x00010041',//监控支路小时用电量
    itr_0x00010042: '0x00010042',//监控支路日用电量
    itr_0x00010043: '0x00010043',//监控支路月（环比）用电量
    itr_0x00010044: '0x00010044',//监控支路月（同比）用电量
    itr_0x00010045: '0x00010045',//监控支路年用电量
    itr_0x00010046: '0x00010046',//监控支路逐时原始读数
    itr_0x00010047: '0x00010047',//系统小时用电量
    itr_0x00010048: '0x00010048',//系统日用电量
    itr_0x00010049: '0x00010049',//系统月用电量
    itr_0x00010050: '0x00010050',//系统月（环比）用电量
    itr_0x00010051: '0x00010051',//系统月（同比）用电量
    itr_0x00010052: '0x00010052',//系统年用电量
    itr_0x00010053: '0x00010053',//机房月内每日用电量明细
    itr_0x00010054: '0x00010054',//机楼日室外平均温度统计
    itr_0x00010055: '0x00010055',//机楼月室外平均温度统计
    itr_0x00010056: '0x00010056',//机房日平均冷通道温度统计
    itr_0x00010057: '0x00010057',//机房月平均冷通道温度统计
    itr_0x00010058: '0x00010058',//机房月平均直流系统输出电压
    itr_0x00010059: '0x00010059',//机房月停电时长统计
    itr_0x00010060: '0x00010060',//机柜小时用电量
    itr_0x00010061: '0x00010061',//机柜日用电量
    itr_0x00010062: '0x00010062',//机柜月用电量
    itr_0x00010063: '0x00010063',//机柜月（环比）用电量
    itr_0x00010064: '0x00010064',//机柜月（同比）用电量
    itr_0x00010065: '0x00010065',//机房用电量趋势异常
    itr_0x00010066: '0x00010066',//机房楼PUE拆分表
    itr_0x00010067: '0x00010067',//机房PUE趋势异常
    itr_0x00010068: '0x00010068',//机房PUE低效预警
    itr_0x00010069: '0x00010069',//电表支路超限预警
    itr_0x00010070: '0x00010070',//机柜超电
    itr_0x00010071: '0x00010071',//系统环比用电
    itr_0x00010072: '0x00010072',//配电系统分级统计
    itr_0x00010073: '0x00010073',//转换效率及功耗分析表
    itr_0x00010074: '0x00010074',//功耗分析表
    
    itr_0x00010080: '0x00010080',//移动巡检记录查询
    itr_0x00010081: '0x00010081',//联动控制日志查询
    itr_0x00010090: '0x00010090',//双机热备切换记录查询
};

module.exports = itr_cmd;