/**
 * Created by wangxh on 2017/7/26.
 */

'use strict';

var mgr_cmd = {

    mgr_0x00000001: '0x00000001',//上传
    mgr_0x00000002: '0x00000002',//上传(完成)
    mgr_0x00000003: '0x00000003',//下载
    mgr_0x00000004: '0x00000004',//下载(完成)

    mgr_0x00000005: '0x00000005',//获取服务器授权时间
    mgr_0x00000006: '0x00000006',//获取服务器授权文件
    mgr_0x00000007: '0x00000007',//上传服务器授权文件

    mgr_0x00000008: '0x00000008',//邮箱配置
    mgr_0x00000009: '0x00000009',//邮箱配置获取
    mgr_0x00000010: '0x00000010',//钉钉配置
    mgr_0x00000011: '0x00000011',//钉钉配置获取
    mgr_0x00000012: '0x00000012',//电话服务配置
    mgr_0x00000013: '0x00000013',//电话服务配置获取

    mgr_0x00000020: '0x00000020',//同步配置(手动,ECC>楼栋)
    mgr_0x00000021: '0x00000021',//模式切换
    mgr_0x00000022: '0x00000022',//获取当前运行模式
    mgr_0x00000023: '0x00000023',//应用沙盒配置

    mgr_0x00010001: '0x00010001',//创建对象
    mgr_0x00010002: '0x00010002',//修改对象
    mgr_0x00010003: '0x00010003',//删除对象
    mgr_0x00010004: '0x00010004',//获取对象信息

    mgr_0x00010005: '0x00010005',//添加设备类型
    mgr_0x00010006: '0x00010006',//修改设备类型
    mgr_0x00010007: '0x00010007',//删除设备类型
    mgr_0x00010008: '0x00010008',//获取设备类型详细信息
    mgr_0x00010009: '0x00010009',//获取设备类型列表

    mgr_0x0001000A: '0x0001000A',//添加报表模板
    mgr_0x0001000B: '0x0001000B',//修改报表模板
    mgr_0x0001000C: '0x0001000C',//删除报表模板
    mgr_0x0001000D: '0x0001000D',//查询报表模板详细信息
    mgr_0x0001000E: '0x0001000E',//查询报表模板列表

    mgr_0x00010010: '0x00010010',//对象扩展属性设置
    mgr_0x00010011: '0x00010011',//对象扩展属性获取

    mgr_0x00010012: '0x00010012',//添加容器关系
    mgr_0x00010013: '0x00010013',//删除容器关系
    mgr_0x00010014: '0x00010014',//修改容器关系

    mgr_0x00010015: '0x00010015',//修改设备模板绑定设备类型

    mgr_0x00010020: '0x00010020',//设备点配置设置
    mgr_0x00010021: '0x00010021',//设备点配置获取
    mgr_0x00010022: '0x00010022',//点值控制

    mgr_0x00010023: '0x00010023',//联动添加
    mgr_0x00010024: '0x00010024',//联动修改
    mgr_0x00010025: '0x00010025',//联动删除
    mgr_0x00010026: '0x00010026',//联动获取
    mgr_0x00010027: '0x00010027',//联动等级设置
    mgr_0x00010028: '0x00010028',//联动等级获取

    mgr_0x00020001: '0x00020001',//创建采集对象
    mgr_0x00020002: '0x00020002',//修改采集对象
    mgr_0x00020003: '0x00020003',//删除采集对象
    mgr_0x00020004: '0x00020004',//获取采集对象信息

    mgr_0x00020005: '0x00020005',//添加采集设备类型
    mgr_0x00020006: '0x00020006',//修改采集设备类型
    mgr_0x00020007: '0x00020007',//删除采集设备类型
    mgr_0x00020008: '0x00020008',//获取采集设备类型详细信息
    mgr_0x00020009: '0x00020009',//获取采集设备类型列表

    mgr_0x00020010: '0x00020010',//设置采集设备点配置
    mgr_0x00020011: '0x00020011',//获取采集设备点配置

    mgr_0x00020012: '0x00020012',//设置采集器联动配置<过时>
    mgr_0x00020013: '0x00020013',//设置采集器联动配置获取<过时>
    mgr_0x00020014: '0x00020014',//采集器实时请求

    mgr_0x00020020: '0x00020020',//巡检记录
    mgr_0x00020021: '0x00020021',//获取巡检记录

    mgr_0x00030001: '0x00030001',//树结构
    mgr_0x00030002: '0x00030002',//查询子对象信息
    mgr_0x00030003: '0x00030003',//获取采集拓扑结构

};

module.exports = mgr_cmd;