/**
 * Created by wangxh on 2017/7/26.
 */

'use strict';

var cpy_cmd = {
    cpy_0x00000001: '0x00000001',//首页ECC
    cpy_0x00000002: '0x00000002',//楼栋
    cpy_0x00000003: '0x00000003',//机房
    cpy_0x00000004: '0x00000004',//数据机房列表查询
    cpy_0x00000005: '0x00000005',//设备-市电
    cpy_0x00000006: '0x00000006',//设备-电源系统(交流)
    cpy_0x00000007: '0x00000007',//设备-电源系统(直流)
    cpy_0x00000008: '0x00000008',//设备-制冷单元
    cpy_0x00000009: '0x00000009',//设备-末端空调

    cpy_0x00010001: '0x00010001',//统计(园区)
    cpy_0x00010002: '0x00010002',//统计(楼栋)
};

module.exports = cpy_cmd;