/**
 * Created by wangxh on 2017/7/26.
 */

'use strict';

var usr_cmd = {
    usr_0x00000001: '0x00000001',//创建人员组
    usr_0x00000002: '0x00000002',//修改人员组
    usr_0x00000003: '0x00000003',//删除人员组
    usr_0x00000004: '0x00000004',//获取人员组信息
    
    usr_0x00000005: '0x00000005',//创建人员
    usr_0x00000006: '0x00000006',//修改人员
    usr_0x00000007: '0x00000007',//删除人员
    usr_0x00000008: '0x00000008',//获取人员信息

    usr_0x00000009: '0x00000009',//查询人员结构
    usr_0x00000010: '0x00000010',//查询权限点
    usr_0x00000011: '0x00000011',//修改admin密码

    usr_0x00000012: '0x00000012',//岗位角色修改
    usr_0x00000013: '0x00000013',//岗位角色获取
    usr_0x00000014: '0x00000014',//岗位角色增加
    usr_0x00000015: '0x00000015',//岗位角色删除
    
    usr_0x00010001: '0x00010001',//创建交接事项
    usr_0x00010002: '0x00010002',//修改交接事项
    usr_0x00010003: '0x00010003',//完成交接事项
    usr_0x00010004: '0x00010004',//查询交接事项列表
    usr_0x00010005: '0x00010005',//查询交接事项详细信息

    usr_0x00010006: '0x00010006',//创建工作日志
    usr_0x00010007: '0x00010007',//修改工作日志
    usr_0x00010008: '0x00010008',//查询工作日志

    usr_0x00020001: '0x00020001',//值班
    usr_0x00020002: '0x00020002',//交班
    usr_0x00020003: '0x00020003',//值班人员查询
};

module.exports = usr_cmd;