/**
 * Created by wangxh on 2017/7/26.
 */

'use strict';

var odr_cmd = {
    odr_0x00000001: '0x00000001',//转交工单
    odr_0x00000002: '0x00000002',//接收工单
    odr_0x00000003: '0x00000003',//处理工单
    odr_0x00000004: '0x00000004',//回退工单
    odr_0x00000005: '0x00000005',//结束工单

    odr_0x00000006: '0x00000006',//工单附件上传(文件)
    odr_0x00000007: '0x00000007',//工单附件删除(文件)

    odr_0x00000008: '0x00000008',//告警生成工单配置
    odr_0x00000009: '0x00000009',//告警生成工单配置获取
    odr_0x0000000A: '0x0000000A',//告警工单配置
    odr_0x0000000B: '0x0000000B',//告警工单配置获取
    odr_0x0000000C: '0x0000000C',//告警类型工单配置
    odr_0x0000000D: '0x0000000D',//告警类型工单配置获取
    odr_0x0000000E: '0x0000000E',//维护工单配置
    odr_0x0000000F: '0x0000000F',//维护工单配置获取
    odr_0x00000010: '0x00000010',//维护工单模板配置
    odr_0x00000011: '0x00000011',//维护工单模板获取
    odr_0x00000012: '0x00000012',//演练工单配置
    odr_0x00000013: '0x00000013',//演练工单配置获取

    odr_0x00000014: '0x00000014',//工单附件上传(base64)
    odr_0x00000015: '0x00000015',//工单附件删除(base64)
    odr_0x00000016: '0x00000016',//工单附件下载(base64)

    odr_0x00000020: '0x00000020',//创建演练工单
    odr_0x00000021: '0x00000021',//创建上下电工单
    odr_0x00000022: '0x00000022',//创建维护(资产)工单

    odr_0x00000023: '0x00000023',//巡检工单派单规则设置
    odr_0x00000024: '0x00000024',//巡检工单派单规则获取
    odr_0x00000025: '0x00000025',//巡检工单通知规则设置
    odr_0x00000026: '0x00000026',//巡检工单通知规则获取
    odr_0x00000027: '0x00000027',//巡检工单模板设置
    odr_0x00000028: '0x00000028',//巡检工单模板获取
    odr_0x00000029: '0x00000029',//巡检数据上传
    odr_0x0000002A: '0x0000002A',//巡检内容配置获取
    odr_0x0000002B: '0x0000002B',//巡检内容配置设置
    odr_0x0000002C: '0x0000002C',//巡检内容配置删除
    odr_0x0000002D: '0x0000002D',//巡检内容配置详情

    odr_0x00000030: '0x00000030',//保存临时数据

    odr_0x00000031: '0x00000031',//创建自定义工单
    odr_0x00000032: '0x00000032',//添加工单模板
    odr_0x00000033: '0x00000033',//修改工单模板
    odr_0x00000034: '0x00000034',//删除工单模板
    odr_0x00000035: '0x00000035',//查询工单模板
    odr_0x00000036: '0x00000036',//查询工单模板列表

    odr_0x00010001: '0x00010001',//工单查询(当前)
    odr_0x00010002: '0x00010002',//工单查询详细信息
    odr_0x00010003: '0x00010003',//工单查询(指定ID查询)
    odr_0x00010004: '0x00010004',//工单查询(办理过的工单)

    odr_0x00010005: '0x00010005',//资产维护工单查询(未办结)
    odr_0x00010006: '0x00010006',//资产维护工单查询(已办结)
    odr_0x00010007: '0x00010007',//演练工单查询(未办结)
    odr_0x00010008: '0x00010008',//演练工单查询(已办结)

    odr_0x00010009: '0x00010009',//上下电工单查询(未办结)
    odr_0x0001000A: '0x0001000A',//上下电工单查询(已办结)

    odr_0x00010010: '0x00010010',//当前工单查询(园区)
    odr_0x00010011: '0x00010011',//当前工单查询(楼栋)
    odr_0x00010012: '0x00010012',//维护工单查询（指定设备）
    odr_0x00010013: '0x00010013',//工单统计(按区域分组)
    odr_0x00010014: '0x00010014',//当前工单查询(机房)
    odr_0x00010015: '0x00010015',//小区工单统计

    odr_0x00020001: '0x00020001',//工单附件下载(文件)
    odr_0x00020002: '0x00020002',//工单附件下载(base64)
};

module.exports = odr_cmd;